**It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?**
**Take this monstrosity as the DataFrame to use in the following puzzles:**
**df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',**
**'londON_StockhOlm',**
**'Budapest_PaRis', 'Brussels_londOn'],**
**'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],**
**'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],**
**'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',**
**'12. Air France', '"Swiss Air"']})**

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).**

In [2]:
df['FlightNumber'][1]=10055
df['FlightNumber'][3]=10075
df['FlightNumber']=df['FlightNumber'].astype(int)
df

C:\Users\HP\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\HP\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [3]:
df['FlightNumber'].dtype

dtype('int32')

**2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.**

In [4]:
x=df['From_To']
p=[]
for a in x:
    p.append(a.split("_",1))
p

[['LoNDon', 'paris'],
 ['MAdrid', 'miLAN'],
 ['londON', 'StockhOlm'],
 ['Budapest', 'PaRis'],
 ['Brussels', 'londOn']]

In [5]:
df['From']=p
df['to']=p

In [6]:
i=0
for i in range(5):
    df['From'][i]=p[i][0]
    df['to'][i]=p[i][1]

C:\Users\HP\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\HP\anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [7]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,to
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

****3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)**

In [8]:
a=df['From']
z=[]
for j in a:
    z.append(j.upper())
df['From']=z
df

,From_To,FlightNumber,RecentDelays,Airline,From,to
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LONDON,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MADRID,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),LONDON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,BUDAPEST,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",BRUSSELS,londOn

In [9]:
s=df['to']
d=[]
for j in s:
    d.append(j.upper())
df['to']=d
df

,From_To,FlightNumber,RecentDelays,Airline,From,to
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LONDON,PARIS
1,MAdrid_miLAN,10055,[],<Air France> (12),MADRID,MILAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),LONDON,STOCKHOLM
3,Budapest_PaRis,10075,[13],12. Air France,BUDAPEST,PARIS
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",BRUSSELS,LONDON

**4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.**

In [10]:
df=df.drop(columns=['From_To'])

In [11]:
df

   FlightNumber  RecentDelays              Airline      From         to
0         10045      [23, 47]               KLM(!)    LONDON      PARIS
1         10055            []    <Air France> (12)    MADRID      MILAN
2         10065  [24, 43, 87]  (British Airways. )    LONDON  STOCKHOLM
3         10075          [13]       12. Air France  BUDAPEST      PARIS
4         10085      [67, 32]          "Swiss Air"  BRUSSELS     LONDON

**5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.**

In [12]:
x=df['RecentDelays']
p=[]
for a in x:
    p.append(a)
p

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [13]:
p

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [14]:
df['RecentDelays'][3]

[13]

In [16]:
df['delay1']=p
df['delay2']=p
df['delay3']=p

In [17]:
for i in range(5):
    if i!=1:
        df['delay1'][i]=df['RecentDelays'][i][0]
    else:
        df['delay1'][i]=np.nan
for i in range(5):
    if i!=1 and i!=3:
        df['delay2'][i]=df['RecentDelays'][i][1]
    else:
        df['delay2'][i]=np.nan 
for i in range(5):
    if i==2:
        df['delay3'][i]=df['RecentDelays'][i][2]
    else:
        df['delay3'][i]=np.nan

C:\Users\HP\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\HP\anaconda3\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
C:\Users\HP\anaconda3\lib\site-packages\ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\HP\anaconda3\lib\site-packages\ipykernel_launcher.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  # Remove the CWD from sys.path while we load stuff.
C:\Users\HP\anaconda3\lib\site-packages\ipykernel_launcher.py:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  from ipykernel import kernelapp as app
C:\Users\HP\anaconda3\lib\site-packages\ipykernel_launcher.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  del sys.path[0]

In [18]:
df

,FlightNumber,RecentDelays,Airline,From,to,delay1,delay2,delay3
0,10045,"[23, 47]",KLM(!),LONDON,PARIS,23,47,NaN
1,10055,[],<Air France> (12),MADRID,MILAN,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),LONDON,STOCKHOLM,24,43,87
3,10075,[13],12. Air France,BUDAPEST,PARIS,13,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",BRUSSELS,LONDON,67,32,NaN

In [20]:
df=df.drop(columns=['RecentDelays'])

In [21]:
df

   FlightNumber              Airline      From         to delay1 delay2 delay3
0         10045               KLM(!)    LONDON      PARIS     23     47    NaN
1         10055    <Air France> (12)    MADRID      MILAN    NaN    NaN    NaN
2         10065  (British Airways. )    LONDON  STOCKHOLM     24     43     87
3         10075       12. Air France  BUDAPEST      PARIS     13    NaN    NaN
4         10085          "Swiss Air"  BRUSSELS     LONDON     67     32    NaN

In [22]:
df.isnull()

   FlightNumber  Airline   From     to  delay1  delay2  delay3
0         False    False  False  False   False   False    True
1         False    False  False  False    True    True    True
2         False    False  False  False   False   False   False
3         False    False  False  False   False    True    True
4         False    False  False  False   False   False    True